tap 'homebrew/bundle'

brew 'coreutils'            # coreutils, because those that came from macOS are too old
brew 'eza'                  # nice ls replacement
brew 'zoxide'               # directory jumper (z command)
brew 'neovim'               # NeoVim
brew 'starship'             # fancy zsh prompt
brew 'git'                  # git
brew 'git-lfs'              # git lfs
brew 'asciinema'            # asciinema - terminal session recorder
brew 'jq'                   # jq - json parser
brew 'yq'                   # yq - yaml parser (jq for yaml)
brew 'fzf'                  # fuzzy finder
brew 'mtr'                  # traceroute
brew 'btop'                 # btop - system monitor
brew 'ripgrep'              # rg - recursive grep
brew 'bat'                  # bat - alternative to cat
brew 'fd'                   # fd - alternative to find
brew 'pwgen'                # pwgen - password generator
brew 'helm'                 # helm - kubernetes package manager
brew 'qemu'                 # qemu - emulator
brew 'node'                 # node - javascript runtime
brew 'yarn'                 # yarn - javascript package manager
cask 'font-hack-nerd-font'  # nerd font
cask 'ghostty'              # ghostty - terminal emulator
brew 'gh'                   # gh - github cli
brew 'parallel'             # parallel - parallel execution tool
brew 'htop'                 # htop - process monitor
brew 'cmake'                # cmake - build system
brew 'ninja'                # ninja - build system
brew 'wget'                 # wget - download tool
brew 'watchman'             # watchman - file watcher
brew 'zsh'                  # zsh - shell
brew 'zlib'                 # zlib - compression library
brew 'telnet'               # telnet - telnet client
brew 'go'                   # go - go programming language
brew 'golangci-lint'        # golangci-lint - go linter
brew 'gnupg'                # gnupg - gnupg tools
